espruino/Espruino/targets/nrf5x/bluetooth.c
       /* assemble 16 byte block */
       uint8_t buf[16]; memset(buf, '\0', 16);
       if(idx + 16 < nfcDataLen) {
         memcpy(buf, nfcDataPtr + idx, 16);
       } else
       if(idx < nfcDataLen) {
         memcpy(buf, nfcDataPtr + idx, nfcDataLen - idx);
       }
       /* send response */
       jsble_nfc_send(buf, 16);
     } else {
       /* no NfcData available, fire js-event */
       bleQueueEventAndUnLock(JS_EVENT_PREFIX"NFCrx",
           jsvNewArrayBufferWithData(bufferLen, buffer));
     }
     break;
   }
#endif
#if BLE_HIDS_ENABLED
   case BLEP_HID_SENT:
     jsiQueueObjectCallbacks(execInfo.root, BLE_HID_SENT_EVENT, 0, 0);
     jsvObjectSetChild(execInfo.root, BLE_HID_SENT_EVENT, 0); // fire only once
     jshHadEvent();
     break;
   case BLEP_HID_VALUE:
     bleQueueEventAndUnLock(JS_EVENT_PREFIX"HID", jsvNewFromInteger(data));
     break;
#endif
#ifdef LINK_SECURITY
      case BLEP_TASK_PASSKEY_DISPLAY: {
        /* TODO: yes/no passkey
uint8_t match_request : 1;               If 1 requires the application to report the match using @ref sd_ble_gap_auth_key_reply
                                         with either @ref BLE_GAP_AUTH_KEY_TYPE_NONE if there is no match or
                                         @ref BLE_GAP_AUTH_KEY_TYPE_PASSKEY if there is a match. */
        if (bufferLen==BLE_GAP_PASSKEY_LEN) {
          buffer[BLE_GAP_PASSKEY_LEN] = 0;
          JsVar *gattServer = bleGetActiveBluetoothGattServer();
          if (gattServer) {
            JsVar *passkey = jsvNewFromString((char*)buffer);
            JsVar *bluetoothDevice = jsvObjectGetChild(gattServer, "device", 0);
            if (bluetoothDevice) {
              jsiQueueObjectCallbacks(bluetoothDevice, JS_EVENT_PREFIX"passkey", &passkey, 1);
              jshHadEvent();
            }
            jsvUnLock3(passkey, bluetoothDevice, gattServer);
          }
        }
        break;
      }
      case BLEP_TASK_AUTH_KEY_REQUEST: {
        //jsiConsolePrintf("BLEP_TASK_AUTH_KEY_REQUEST\n");
        uint16_t conn_handle = data;
#if CENTRAL_LINK_COUNT>0
        if (conn_handle == m_central_conn_handle) {
          JsVar *gattServer = bleGetActiveBluetoothGattServer();
          if (gattServer) {
            jsvObjectSetChildAndUnLock(gattServer, "connected", jsvNewFromBool(false));
            JsVar *bluetoothDevice = jsvObjectGetChild(gattServer, "device", 0);
            if (bluetoothDevice) {
              // HCI error code, see BLE_HCI_STATUS_CODES in ble_hci.h
              jsiQueueObjectCallbacks(bluetoothDevice, JS_EVENT_PREFIX"passkeyRequest", 0, 0);
              jshHadEvent();
            }
            jsvUnLock2(gattServer, bluetoothDevice);
          }
        } else
#endif
        if (conn_handle == m_peripheral_conn_handle) {
          bool ok = false;
          JsVar *options = jsvObjectGetChild(execInfo.hiddenRoot, BLE_NAME_SECURITY, 0);
          if (jsvIsObject(options)) {
            JsVar *oobKey = jsvObjectGetChild(options, "oob", 0);
            JSV_GET_AS_CHAR_ARRAY(keyPtr, keyLen, oobKey);
            if (keyPtr && keyLen==BLE_GAP_SEC_KEY_LEN) {
              ok = true;
              //jsiConsolePrintf("Replying with Auth key %d,%d,%d,%d...\n",keyPtr[0],keyPtr[1],keyPtr[2],keyPtr[3]);
              jsble_check_error(sd_ble_gap_auth_key_reply(conn_handle,
                                                   BLE_GAP_AUTH_KEY_TYPE_OOB,
                                                   (uint8_t *)keyPtr));
            }
            jsvUnLock(oobKey);
          }
          jsvUnLock(options);
          if (!ok) jsExceptionHere(JSET_INTERNALERROR, "Auth key requested, but NRF.setSecurity({oob}) not valid");
        }
        break;
       }
      case BLEP_TASK_AUTH_STATUS: {
        //uint16_t conn_handle = data;
        ble_gap_evt_auth_status_t *auth_status = (ble_gap_evt_auth_status_t*)buffer;
        JsVar *o = jsvNewObject();
        if (o) {
          const char *str=NULL;
          switch(auth_status->auth_status) {
            case BLE_GAP_SEC_STATUS_SUCCESS                : str="SUCCESS";break;
            case BLE_GAP_SEC_STATUS_TIMEOUT                : str="TIMEOUT";break;
            case BLE_GAP_SEC_STATUS_PDU_INVALID            : str="PDU_INVALID";break;
            case BLE_GAP_SEC_STATUS_RFU_RANGE1_BEGIN       : str="RFU_RANGE1_BEGIN";break;
            case BLE_GAP_SEC_STATUS_RFU_RANGE1_END         : str="RFU_RANGE1_END";break;
            case BLE_GAP_SEC_STATUS_PASSKEY_ENTRY_FAILED   : str="PASSKEY_ENTRY_FAILED";break;
            case BLE_GAP_SEC_STATUS_OOB_NOT_AVAILABLE      : str="OOB_NOT_AVAILABLE";break;
            case BLE_GAP_SEC_STATUS_AUTH_REQ               : str="AUTH_REQ";break;
            case BLE_GAP_SEC_STATUS_CONFIRM_VALUE          : str="CONFIRM_VALUE";break;
            case BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP       : str="PAIRING_NOT_SUPP";break;
            case BLE_GAP_SEC_STATUS_ENC_KEY_SIZE           : str="ENC_KEY_SIZE";break;
            case BLE_GAP_SEC_STATUS_SMP_CMD_UNSUPPORTED    : str="SMP_CMD_UNSUPPORTED";break;
            case BLE_GAP_SEC_STATUS_UNSPECIFIED            : str="UNSPECIFIED";break;
            case BLE_GAP_SEC_STATUS_REPEATED_ATTEMPTS      : str="REPEATED_ATTEMPTS";break;
            case BLE_GAP_SEC_STATUS_INVALID_PARAMS         : str="INVALID_PARAMS";break;
            case BLE_GAP_SEC_STATUS_DHKEY_FAILURE          : str="DHKEY_FAILURE";break;
            case BLE_GAP_SEC_STATUS_NUM_COMP_FAILURE       : str="NUM_COMP_FAILURE";break;
            case BLE_GAP_SEC_STATUS_BR_EDR_IN_PROG         : str="BR_EDR_IN_PROG";break;
            case BLE_GAP_SEC_STATUS_X_TRANS_KEY_DISALLOWED : str="X_TRANS_KEY_DISALLOWED";break;
          }
          jsvObjectSetChildAndUnLock(o,"auth_status",str?jsvNewFromString(str):jsvNewFromInteger(auth_status->auth_status));
          jsvObjectSetChildAndUnLock(o, "bonded", jsvNewFromBool(auth_status->bonded));
          jsvObjectSetChildAndUnLock(o, "lv4", jsvNewFromInteger(auth_status->sm1_levels.lv4));
          jsvObjectSetChildAndUnLock(o, "kdist_own", jsvNewFromInteger(*((uint8_t *)&auth_status->kdist_own)));
          jsvObjectSetChildAndUnLock(o, "kdist_peer", jsvNewFromInteger(*((uint8_t *)&auth_status->kdist_peer)));
          bleQueueEventAndUnLock(JS_EVENT_PREFIX"security",o);
        }
        break;
      }
#endif
#ifdef ESPR_BLUETOOTH_ANCS
      case BLEP_ANCS_NOTIF:
        ble_ancs_handle_notif(blep, (ble_ancs_c_evt_notif_t*)buffer);
        break;
      case BLEP_ANCS_NOTIF_ATTR:
        ble_ancs_handle_notif_attr(blep, (ble_ancs_c_evt_notif_t*)buffer);
        break;
      case BLEP_ANCS_APP_ATTR:
        ble_ancs_handle_app_attr(blep, (char *)buffer, bufferLen);
        break;
      case BLEP_AMS_UPDATE:
        ble_ams_handle_update(blep, data, (char *)buffer, bufferLen);
        break;
      case BLEP_AMS_ATTRIBUTE:
        ble_ams_handle_attribute(blep, (char *)buffer, bufferLen);
        break;
#endif
   default:
     jsWarn("jsble_exec_pending: Unknown enum type %d",(int)blep);
 }
 return eventsHandled;
}


// -----------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------

/** Set the connection interval of the peripheral connection. Returns an error code. */
uint32_t jsble_set_periph_connection_interval(JsVarFloat min, JsVarFloat max) {
  ble_gap_conn_params_t   gap_conn_params;
  memset(&gap_conn_params, 0, sizeof(gap_conn_params));
  gap_conn_params.min_conn_interval = (uint16_t)(0.5+MSEC_TO_UNITS(min, UNIT_1_25_MS));   // Minimum acceptable connection interval
  gap_conn_params.max_conn_interval = (uint16_t)(0.5+MSEC_TO_UNITS(max, UNIT_1_25_MS));    // Maximum acceptable connection interval
  gap_conn_params.slave_latency     = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;
  if (jsble_has_peripheral_connection()) {
    // Connected - initiate dynamic change
    return ble_conn_params_change_conn_params(
#if NRF_SD_BLE_API_VERSION>=5
        m_peripheral_conn_handle,
#endif
        &gap_conn_params);
  } else {
    // Not connected, just tell the stack
    return sd_ble_gap_ppcp_set(&gap_conn_params);
  }
}

